Revit 2024 API
ACADExportOptions.HatchBackgroundColor Property
 The color that will be set as hatch backgound color on the exported hatch. This color will be used only if useHatchBackgroundColor is true. default value is white
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public Color HatchBackgroundColor { get; set; }
Visual Basic
Public Property HatchBackgroundColor As Color
	Get
	Set
Visual C++
public:
property Color^ HatchBackgroundColor {
	Color^ get ();
	void set (Color^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
ACADExportOptions Class
Autodesk.Revit.DB Namespace